{
    "events":[
        
        {
            "our-events":{
            "title":"Our Events",
            "description":"We have a plethora of events that grooms an individual booth in the professional domain and the personal domain.Be it the DSA Marathon or Development, ML and Design Workshops or any other technical domain, we stand high on the zenith.Be it the physical activities, we have CSS Olympics always raising one's sportsmanship. You think of cultural fests, we have the ESPERANZA, CSS GO and many more bullets of enjoyment in our arsenal with our annual week CSS ABACUS being the head honcho, the Mother of Festivals always making an example set in stone. You name an event, we have it. Our dedicated team with the motto of PARTICIPATE ENJOY AND LEARN makes the events which makes an individual an All-Rounder and his/her moments of life unforgettable an exciting."
            }
        },


        {
            "id":1,
            "section":"Yearly",
            "name": "Abacus" ,
            "slug": "abacus",
            "description": "The annual Computer Science and Engineering week - ABACUS! The excitement begins each year, for the Annual week of the CSE department in which different games and competitions takes place where everyone gets a cool opportunity to prove their skills down and claim the prize money. But the most unique point about it is that it gives you, the freshers, the opportunity to become organizers, to present your ideas, instead of just participating and enables you to learn numerous things.",
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer":"Computer Science Society",
            "registrationLink": "@",
            "poster-url": "https://res.cloudinary.com/dx8jytou0/image/upload/f_webp/v1757495059/Abacus_az0bsl.png",
            "more-events":[
                {
                    "name":"CSS Hacks",
                    "slug": "css-hacks",
                    "description":"CSS Hacks, the ultimate web development hackathon under ABACUS, and this time, the grid is charged with cyberpunk energy.Brainstorm. Break into the mainframe of creativity and pitch your most innovative ideas.",
                    "status":"upcoming",
                    "date": "",
                    "venue": "",
                    "registration-link": null,
                    "poster-url":  null
                },
                {
                    "name":"Datathon",
                    "slug":"datathon",
                     "description":"Jack into the mainframe, sync your neural uplink, and brace yourself for a high-stakes descent into the raw pulse of data. The Neon Grid Datathon isn’t just a contest—it’s a warzone of intellect, where cyber-sleuths, AI tacticians, and code-warriors decrypt the future one dataset at a time.",
                    "status":"upcoming",
                    "date": "",
                    "venue": "",
                    "registration-link": null,
                    "poster-url":  null
                },
                {
                    "name":"Open Source Marathon",
                    "slug":"open source marathon",
                    "description":"With the Open Source Marathon, the Computer Science Society sets their sights on helping students explore the dark back-alleys of open-source software development, in the process, having them gang-up with their peers, and enabling them to build their empire in open-source software.",
                    "status":"upcoming",
                    "date": "",
                    "venue": "",
                    "registration-link": null,
                    "poster-url":  null
                },
                {
                    "name": "Treasure Hunt",
                   " slug": "treasure-hunt",
                    "description":"Get ready for the ultimate test of wit, teamwork, and strategy! Are you ready to decipher cryptic clues and claim The Final Paycheque? CSS brings you the most thrilling treasure hunt across the campus!",
                    "status": "upcoming",
                    "organizer": "Computer Science Society",
                    "date": "",
                    "venue": "",
                    "registrationLink": null,
                    "poster-url": "https://res.cloudinary.com/dx8jytou0/image/upload/f_webp/v1757501229/Screenshot_2025-09-10_161836_ma94ly.png"
                },
                {
                    "name": "Abacus Got Latent",
                    "slug": "abacus-got-latent",
                    "description":"Aspiring to become Samay Raina but don’t want to go to JAIL! Welcome to ‘ABACUS Got LATENT’, the ultimate talent showdown where self-awareness meets creativity! This is your chance to showcase your hidden talent- whether it’s dark comedy, mimicry, singing, acting, or any unique skill.",
                    "status": "upcoming",
                    "organizer": "Computer Science Society",
                    "date": "",
                    "venue": "",
                    "registrationLink": null,
                    "poster-url": "https://res.cloudinary.com/dx8jytou0/image/upload/f_webp/v1757501445/Screenshot_2025-09-10_162215_w81bsa.png"
                },
                {
                    "name": "Chase Cloud 9",
                    "slug": "chase-cloud-9",
                    "description":"Chase Cloud 9, an intense challenge brought by the Computer Science Society. It’s the ultimate test to find the next tech masterminds—designed to simulate the most rigorous real-world recruitment processes.",
                    "status": "upcoming",
                    "organizer": "Computer Science Society",
                    "date": "",
                    "venue": "",
                    "registrationLink": null,
                    "poster-url": "https://res.cloudinary.com/dx8jytou0/image/upload/f_webp/v1757501619/Screenshot_2025-09-10_162429_wexhhb.png"
                },
                {
                    "name": "Riddlex",
                    "slug": "riddlex",
                    "description":"Riddlex is here to put your wits to the test! No DSA, no CP—just pure mind-bending fun. Crack the code, claim the prize, and show the system who’s boss! Are you up for the challenge?",
                    "status": "upcoming",
                    "organizer": "Computer Science Society",
                    "date": "",
                    "venue": "",
                    "registrationLink": null,
                    "poster-url": "https://res.cloudinary.com/dx8jytou0/image/upload/v1757501771/Screenshot_2025-09-10_162735_jjocgt.png"
                }
            ]
        
        },

        {
            "id":2,
            "section":"Yearly",
            "name": "Enigma" ,
            "slug": "enigma",
            "description": "ENIGMA provides an opportunity for the freshman of the college to get introduced to the field of competitive programming. It prepares the students for internship/placement season by providing an opportunity to take a shot at real time Coding Round Problems. Our alumni have also, at many times appreciated this highly esteemed initiative by the CP Wing of the Society, given the value addition it has accentuated in the brightest of minds",
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer":"Computer Science Society",
            "poster-url":  null,
            "registration-link": null
            
        },


        {
            "id":3,
            "section":"Cultural",
            "name": "Orientation" ,
            "slug": "orientation",
           
             "description": "The CSS organizes the official society orientation programme each year for the fresher batch.The program aims to make the students aware of the wide range of opportunities, events and programmes that society offers. It introduces the freshers to the various divisions and initiatives of the society",
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer":"Computer Science Society",
            "poster-url":  null,
            "registration-link": null
            
        },


        {
            "id":4,
            "section":"Cultural",
            "name": "Esperanza" ,
            "slug": "esperanza",
            
            "description": "The official branch freshers for cse is organized by the CSS every year. The objective of the freshers is to provide the  students with a platform to interact with their batchmates and to kickstart their college journey with a bunch of fun and engaging events",
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "Computer Science Society",
            "poster-url":  null  
            
        },

        {
            "id":5,
            "section":"Cultural",
            "name": "The Insipre Room" ,
            "slug": "the-inspire-room" ,
            
            "description": "The Computer Science Society organizes numerous speaker sessions throughout the course of the year featuring techies from across the country. The words of guidance from the speakers target to ignite within the students a sense of zeal and initiative as they strive forward in their respective fields" ,
            
            "organizer": "Computer Science Society",
            "status":"upcoming",
            "date": "",
            "venue": "",
            "poster-url": null  ,
            "registration-link": null
            
        },

        {
            "id":6,
            "section":"Cultural",
            "name": "CSS Olympics" ,
            "slug": "css-olympics" ,
            
            "description": "CSS Olympics is the annual sports week conducted by the society and garners participation from all CSE batches. It provides a platform for the students to demonstrate their athletic abilities while participating in a wide range of sporting activities" ,
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "Computer Science Society",
            "poster-url": null  ,
            "registration-link": null
            
        },

        {
            "id":7,
            "section":"Cultural",
            "name": "CSS GO",
            "slug": "css-go",
             "description": "Being part of the society and it's legacy is an honour in no small sense.CSS organizes a plethora of fun events to commemorate the formation of society each year. The event is exclusively for second years CSE students and is organized by the second-year wing members themselves" ,
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "Computer Science Society" ,
            "poster-url": null ,
            "registration-link": null
            
        },

        {
            "id":8,
            "section":"Cultural",
            "name": "Farewell",
            "slug": "farewell",
            "description": "CSS organizes the farewell programme each year to bid adieu to the senior cse batch of the institute. The objective is to provide the seniors with a platform to relish and relive the joyous moments of their college lives and to honor their contributions to the institute and the student body" ,
            
            "date": "",
            "venue": "",
            "organizer": "Computer Science Society" ,
            "poster-url": null ,
            "registration-link": null
            
        },

        {
            "id":9,
            "section":"Technical",
            "name": "Development Workshops",
            "slug": "development-workshops",
            "description": "CSS organizes numerous development workshops throughout the course of the year which are conducted by the DEV Wing to help the students navigate through the challenging concepts of fields like app dev, web dev, web3, etc." ,
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "DEV Wing" ,
            "poster-url": null ,
            "registration-link": null
            
        },

        {
            "id":10,
            "section":"Technical",
            "name": "ML Sessions",
            "slug": "ml-sessions",
            "description": "Machine Learning is one of the fastest-growing domains in computer science with several applications in data analytics. The ML wing of CSS organizes ML sessions on a regular basis to mentor students and help them advance in the field and pursue a career in it" ,
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "ML Wing" ,
            "poster-url": null ,
            "registration-link": null
            
        },

        {
            "id":11,
            "section":"Technical",
            "name": "Open Source Marathon",
            "slug": "open-source-marathon",
            "description": "The Computer Science Society organizes hackathons throughout the course of the year which are open source.It is a great opportunity to get to know others that have the same interests and it is a great add up to your CV" ,
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "Computer Science Society" ,
            "poster-url": null ,
            "registration-link": null
            
        },

        {
            "id":12,
            "section":"Technical",
            "name": "DSA Marathon",
            "slug": "dsa-marathon",
             "description": "The Computer Science Society organizes DSA marathon events to help the students improve their DSA skills which can help them in their carrerand improve their coding skills as well as in creating a competetive enviornment among the students" ,
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "Computer Science Society" ,
            "poster-url": null ,
            "registration-link": null
            
        },

        {
            "id":13,
            "section":"Technical",
            "name": "Design Workshops",
            "slug": "design-workshops",
            "description": "The Computer Science Society organizes various design workshops throughout the year for the studentsthus helping them in improving their desgin skills in various fields" ,
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "Design Wing" ,
            "poster-url": null ,
            "registration-link": null
            
        },

        {
            "id":14,
            "section":"Technical",
            "name": "C Classes",
            "slug": "c-classes",
             "description": "Every year CSS organizes introductory to advanced-level classes in C programming for freshers taken by the CSE sophomores themselves. The aim of the programme is to provide the students with a mentor who has followed the same path as themselves and resolve the problems faced by the freshers" ,
            
            "status":"upcoming",
            "date": "",
            "venue": "",
            "organizer": "Computer Science Society" ,
            "poster-url": null ,
            "registration-link": null
            
        }
    ]
}
